Repository: buiduccanh10/money_mate
Catalog: lib/l10n/app_*.arb
Languages: vi

source: Home
vi: Trang chủ

source: Input
vi: Nhập

source: Search
vi: Tìm kiếm

source: Chart
vi: Biểu đồ

source: Setting
vi: Cài đặt

# helloHomeAppbar
source: Hi,
vi: Xin chào,

# totalSaving
source: Total:
vi: Tổng:

source: Income
vi: Thu nhập

source: Expense
vi: Chi phí

# noInputData
source: No input data yet !
vi: Chưa có dữ liệu nhập vào !

# slideEdit
source: Edit
vi: Sửa

# slideDelete
source: Delete
vi: Xoá

# inputDescription
source: Description (Optional)
vi: Mô tả

# inputMoney
source: Money
vi: Tiền

source: Income category
vi: Danh mục thu nhập

source: Expense category
vi: Danh mục chi phí

source: More...
vi: Thêm...

# inputVave
source: Save
vi: Lưu

# inCategoryManageAppbar
source: Income category manage
vi: Quản lí danh mục thu nhập

# exCategoryManageAppbar
source: Expense category manage
vi: Quản lí danh mục chi phí

# inDeleteAllTitle
source: Delete all income category ?
vi: Xoá tất cả danh mục thu nhập ?

# exDeleteAllTitle
source: Delete all expense category ?
vi: Xoá tất cả danh mục chi phí ?

source: Confirm
vi: Xác nhận

source: Cancel
vi: Huỷ

# addCatDialogTitle
source: Add a new category
vi: Thêm một danh mục mới

source: Choose an icon
vi: Chọn một biểu tượng

source: Category name
vi: Tên danh mục

# updateCatTitle
source: Update category
vi: Cập nhật danh mục

source: Update
vi: Cập nhật

source: Type any to search...
vi: Nhập bất kì để tìm kiếm...

# switchMonthly
source: Monthly
vi: Hàng tháng

# switchYearly
source: Yearly
vi: Hàng năm

source: Modify
vi: Chỉnh sửa

# modifyDes
source: Tap to change your profile
vi: Nhấn để thay đổi hồ sơ của bạn

source: Language
vi: Ngôn ngữ

source: Currency
vi: Tiền tệ

source: Appearance
vi: Giao diện

source: Application lock
vi: Khoá ứng dụng

# applicationLockDes
source: Use Passwork or FaceID when open
vi: Sử dụng mật khẩu hoặc FaceID khi mở ứng dụng

source: Privacy
vi: Quyền riêng tư

# privacyDes
source: More privacy options
vi: Thêm lựa chọn quyền riêng tư

source: About
vi: Giới thiệu

# aboutDes
source: Learn more about Money Mate
vi: Tìm hiểu thêm về Money Mate

source: Send feedback
vi: Gửi nhận xét

# sendFeedbackDes
source: Let us know your experience about app
vi: Cho chúng tôi biết trải nghiệm của bạn về ứng dụng

source: Log out
vi: Đăng xuất

# noCatYet
source: No category yet !
vi: Chưa có danh mục nào !

# logOutDialog
source: Sign out your account ?
vi: Đăng xuất tài khoản của bạn ?

# languageAppbar
source: Language
vi: Ngôn ngữ

# languageDes
source: English
vi: Tiếng Việt

# opEn
source: English
vi: Tiếng Anh

# opVi
source: Vietnamese
vi: Tiếng Việt

# opCn
source: Chinese
vi: Tiếng Trung

source: Email
vi: Địa chỉ email

source: Password
vi: Mật khẩu

# forgotPass
source: Forgot your password ?
vi: Quên mật khẩu ?

source: Log in
vi: Đăng nhập

# dontHaveAcc
source: Don't you have account ?
vi: Bạn không có tài khoản ?

source: Sign up
vi: Đăng ký

# orSignIn
source: Or sign in with:
vi: Hoặc đăng nhập bằng:

# signInGg
source: Sign in with Google
vi: Đăng nhập với Google

# deleteAllDataAcc
source: Delete all data
vi: Xoá tất cả dữ liệu

# deleteAllDataAccDes
source: Your input, category,... data will be delete
vi: Dữ liệu nhập vào, danh mục,... của bạn sẽ bị xoá

# deleteAcc
source: Delete account
vi: Xoá tài khoản

# deleteAccDes
source: Your account will no longer exist
vi: Tài khoản của bạn sẽ không còn tồn tại

# toastAddSuccess
source: Create successfull !
vi: Tạo thành công!

# toastUpdateSuccess
source: Update successfull !
vi: Cập nhật thành công!

# toastDeleteSuccess
source: Delete successfull !
vi: Xoá thành công!

# toastAddFail
source: Create fail !
vi: Tạo thất bại!

# toastUpdateFail
source: Update fail !
vi: Cập nhật thất bại!

# toastDeleteFail
source: Delete fail !
vi: Xoá thất bại!

# toastDeleteUserFail
source: Delete user fail ! (Login and try again)
vi: Xoá người dùng thất bại! (Đăng nhập và thử lại)

# toastLoginSuccess
source: Login successful !
vi: Đăng nhập thành công!

# toastLoginFail
source: Wrong user or password !
vi: Sai tên người dùng hoặc mật khẩu!

# toastSignupSuccess
source: Sign up successful, check the link in your email to verify !
vi: Đăng ký thành công, kiểm tra liên kết trong email của bạn để xác minh!

# toastSignupFail
source: Sign up failed !
vi: Đăng ký thất bại!

# toastSignupWeakpass
source: Password too weak !
vi: Mật khẩu quá yếu!

# toastUserExist
source: Email already exists
vi: Email đã tồn tại

# toastNotFound
source: Not found !
vi: Không tìm thấy!

# toastVerifyEmail
source: Your account not verify, check the link in your email !
vi: Tài khoản của bạn chưa được xác minh, kiểm tra liên kết trong email của bạn!

# toastUserNotExist
source: User is not exist !
vi: Người dùng không tồn tại!

# catValidator
source: No category selected yet !
vi: Chưa có danh mục nào được chọn !

# moneyValidator
source: Money field can not be blank
vi: Trường số tiền không được để trống

# darkmodeLightDes
source: Light
vi: Sáng

# darkmodeDarkDes
source: Dark
vi: Tối

# localAuthTitle
source: Authenticate to access the app
vi: Xác thực để truy cập ứng dụng

# localAuthWarning
source: Your device don't have any security method, set it again !
vi: Thiết bị của bạn không có bất kỳ phương thức bảo mật nào, hãy thiết lập lại!

source: No available
vi: Không có sẵn

# catIconValidator
source: Please choose an icon
vi: Vui lòng chọn một biểu tượng

# catNameValidator
source: Please enter category name
vi: Vui lòng nhập tên danh mục

source: Advanced settings
vi: Cài đặt nâng cao

# fixedInEx
source: Set up fixed income and expense
vi: Thiết lập thu nhập và chi phí cố định

# fixedInExDes
source: Automating recurring income and expense entries
vi: Tự động hóa các mục thu nhập và chi phí định kỳ

source: Delete all schedule ?
vi: Xóa tất cả lịch trình ?

source: No set up yet !
vi: Chưa thiết lập !

source: Set up
vi: Thiết lập

source: Select category:
vi: Chọn danh mục:

source: Repeat:
vi: Lặp lại:

# neverRepeat
source: Never
vi: Không bao giờ

source: Daily
vi: Hàng ngày

source: Weekly
vi: Hàng tuần

source: Monthly
vi: Hàng tháng

source: Yearly
vi: Hàng năm

source: Pay by e-wallet
vi: Thanh toán bằng ví điện tử

# payByEWalletDes
source: Payment is via e-wallet, and saved as an expense
vi: Thanh toán qua ví điện tử và được lưu dưới dạng chi phí

# payByEWalletTitle
source: Choose a e-wallet
vi: Chọn ví điện tử

# paymentMethodTitle
source: Payment method
vi: Phương thức thanh toán

# paymentMethodQr
source: QR Code
vi: Mã QR

# paymentMethodNew
source: New beneficiary
vi: Người thụ hưởng mới

# paypalAccountHolder
source: Account holder
vi: Chủ tài khoản

# paypalContentBilling
source: Content billing
vi: Nội dung thanh toán

# optionCategory
source: Category (optional):
vi: Danh mục (Không bắt buộc):

source: Check out
vi: Thanh toán

# paypalSuccess
source: Payment success
vi: Thanh toán thành công

# paypalFail
source: Payment fail
vi: Thanh toán không thành công

# paypalCancel
source: Payment cancel
vi: Hủy thanh toán

# settingLimitTitle
source: Spending limit
vi: Giới hạn chi tiêu

# settingLimitDes
source: Set limit for each spending category
vi: Thiết lập giới hạn cho mỗi danh mục chi tiêu

# restoreAllLimitTitle
source: Restore all limit
vi: Khôi phục tất cả giới hạn

# restoreLimit
source: Restore
vi: Khôi phục

# noLimit
source: No limit yet
vi: Chưa có giới hạn

# limitDialog
source: Set limit for
vi: Thiết lập giới hạn cho

# overLimit
source: Exceeded the expense limit of
vi: Vượt giới hạn chi tiêu của

source: over
vi: vượt

# limitSuccess
source: Set limit success
vi: Thiết lập giới hạn thành công

# limitFail
source: Set limit fail
vi: Thiết lập giới hạn thất bại

source: Restore limit success
vi: Khôi phục giới hạn thành công

source: Restore limit fail
vi: Khôi phục giới hạn thất bại

source: Restore all limit success
vi: Khôi phục tất cả giới hạn thành công

source: Restore all limit fail
vi: Khôi phục tất cả giới hạn thất bại

source: Update Avatar
vi: Cập nhật ảnh đại diện

# tapToUpload
source: Tap on the image to upload a new avatar
vi: Chạm vào ảnh để tải ảnh mới

source: Save
vi: Lưu

source: Name
vi: Tên

# newPassword
source: New Password (Optional)
vi: Mật khẩu mới (Không bắt buộc)

# avatarUpdated
source: Avatar updated successfully
vi: Cập nhật ảnh đại diện thành công

# avatarUpdateFail
source: Failed to update avatar
vi: Cập nhật ảnh đại diện thất bại

# profileUpdated
source: Profile updated successfully
vi: Cập nhật hồ sơ thành công

source: Unlock
vi: Mở khoá
